In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# List of Data to Combine

+ usa_18_year_old_in_education_national.csv
+ usa_edu_teach_stud_outcomes_state.csv
+ usa_ele_sec_expenditure_percent_gov_states.csv
+ usa_GDP_per_capita_state.csv
+ usa_num_known_property_crimes_state.csv
+ usa_per_capita_income_state.csv
+ usa_population_state.csv
+ usa_tax_collection_state.csv
+ usa_unemployment_rate_state.csv
+ usa_youth_access_to_edu_national.csv
+ elsect_summary.csv

# Data loading

## Educational finance summary

+ 2000 ~ 2015

In [2]:
df0 = pd.read_csv('./data/data_raw/elsect_summary.csv')

In [3]:
df0 = df0[['STATE', 'YEAR', 'ENROLL', 'TOTAL_REVENUE', 'TOTAL_EXPENDITURE']]

In [4]:
df0.columns = df0.columns.str.lower()

In [5]:
df0.year.unique()

array([1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015])

In [6]:
df0.head()

        state  year  enroll  total_revenue  total_expenditure
0     Alabama  1992     NaN        2678885            2653798
1      Alaska  1992     NaN        1049591             972488
2     Arizona  1992     NaN        3258079            3401580
3    Arkansas  1992     NaN        1711959            1743022
4  California  1992     NaN       26260025           27138832

In [7]:
df = df0[df0.year >= 2000].reset_index(drop = True)

## usa_edu_teach_stud_outcomes_state

In [8]:
df0 = pd.read_csv('./data/data_raw/usa_edu_teach_stud_outcomes_state.csv')

In [9]:
df0.head()

,region,indicator,Unit,Date,Value
0,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2000,72.247694
1,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2009,79.927800
2,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2011,81.830900
3,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2012,84.477400
4,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2013,81.905100

In [10]:
df0.indicator.unique()

array(['18- to 24-Year-Olds Who Were High School Completers',
       "Population 25 Years Old and Over Who Have Bachelor's or Higher Degree",
       'Enrollment in Public Elementary and Secondary Schools',
       'Average Daily Attendance in Public Elementary and Secondary Schools',
       'Public Elementary and Secondary Teachers',
       'Pupil/Teacher Ratios in Public Elementary and Secondary Schools',
       'Public High School Graduates',
       'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools'],
      dtype=object)

enrollment data, missing 1991 ~1994 data, take from the other data set, **Drop**

In [11]:
df0[df0.indicator == 'Enrollment in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 1995, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [12]:
df0 = df0[df0.indicator != 'Enrollment in Public Elementary and Secondary Schools']

Average daily attendance in pub & ele schools **USE** , **NOT Complete** -> missing data 1991~1999, 2015

In [13]:
df0[df0.indicator == 'Average Daily Attendance in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013, 2014])

In [14]:
df0[df0.indicator == 'Average Daily Attendance in Public Elementary and Secondary Schools'].Unit.unique()

array(['Number'], dtype=object)

In [15]:
df = df.join(
    df0[df0.indicator == 'Average Daily Attendance in Public Elementary and Secondary Schools']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'avg_attendence_elem_secd_schools')

In [16]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools
0,Alabama,2000,730184.0,4885917,5003267,725212.0
1,Alaska,2000,132822.0,1313510,1386904,122412.0
2,Arizona,2000,814807.0,5479168,5397194,782851.0
3,Arkansas,2000,450751.0,2844855,2683400,422958.0
4,California,2000,5941946.0,46628207,45829753,5957216.0

Public Elementary and Secondary Teachers  **USE**

In [17]:
df0[df0.indicator== 'Public Elementary and Secondary Teachers'].Date.unique()

array([2000, 2005, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014])

In [18]:
df = df.join(
    df0[df0.indicator == 'Public Elementary and Secondary Teachers']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'teachers_elem_secd_schools')

In [19]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4

'18- to 24-Year-Olds Who Were High School Completers', **Use**, *Not complete*

In [20]:
df0[df0.indicator == '18- to 24-Year-Olds Who Were High School Completers'].Date.unique()

array([2000, 2009, 2011, 2012, 2013, 2014])

In [21]:
df0[df0.indicator == '18- to 24-Year-Olds Who Were High School Completers'].Unit.unique()

array(['Percent'], dtype=object)

In [22]:
df = df.join(
    df0[df0.indicator == '18- to 24-Year-Olds Who Were High School Completers']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'high_school_completers_18_to_24')

normalize percentage

In [23]:
df.high_school_completers_18_to_24 = df.high_school_completers_18_to_24 / 100

In [24]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395

"Population 25 Years Old and Over Who Have Bachelor's or Higher Degree", **use**, *not complete*

In [25]:
df0[df0.indicator =="Population 25 Years Old and Over Who Have Bachelor's or Higher Degree"].Date.unique()

array([2000, 2009, 2011, 2012, 2013, 2014])

In [26]:
df = df.join(
    df0[df0.indicator == "Population 25 Years Old and Over Who Have Bachelor's or Higher Degree"]\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'bachelor_completers_over_25')

Normalize percentage

In [27]:
df.bachelor_completers_over_25 = df.bachelor_completers_over_25 / 100

In [28]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266

'Pupil/Teacher Ratios in Public Elementary and Secondary Schools', **use** *not complete*

In [29]:
df0[df0.indicator =='Pupil/Teacher Ratios in Public Elementary and Secondary Schools'].Date.unique()

array([2000, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014])

In [30]:
df = df.join(
    df0[df0.indicator == 'Pupil/Teacher Ratios in Public Elementary and Secondary Schools']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'pupil_teacher_ratio')

In [31]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279

'Public High School Graduates' **use**, *not complete*

In [32]:
df0[df0.indicator == 'Public High School Graduates'].Date.unique()

array([1990, 2000, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
       2013, 2014, 2015, 2016])

In [33]:
df = df.join(
    df0[df0.indicator == 'Public High School Graduates']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'pub_high_school_graduates')

'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools', **USE**

In [34]:
df0[df0.indicator == 'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools'].Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014])

In [35]:
df = df.join(
    df0[df0.indicator == 'Current Expenditure per Pupil in Average Daily Attendance in Public Elementary and Secondary Schools']\
    .set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

df.info()

df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'expenditure_per_pupil')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 14 columns):
state                               816 non-null object
year                                816 non-null int64
enroll                              816 non-null float64
total_revenue                       816 non-null int64
total_expenditure                   816 non-null int64
avg_attendence_elem_secd_schools    765 non-null float64
teachers_elem_secd_schools          510 non-null float64
high_school_completers_18_to_24     306 non-null float64
bachelor_completers_over_25         306 non-null float64
pupil_teacher_ratio                 561 non-null float64
pub_high_school_graduates           663 non-null float64
indicator                           765 non-null object
Unit                                765 non-null object
Value                               765 non-null float64
dtypes: float64(8), int64(3), object(3)
memory usage: 89.3+ KB

In [36]:
df0.head()

,region,indicator,Unit,Date,Value
0,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2000,72.247694
1,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2009,79.927800
2,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2011,81.830900
3,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2012,84.477400
4,Alabama,18- to 24-Year-Olds Who Were High School Compl...,Percent,2013,81.905100

In [37]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [38]:
df0.region.unique()  == df.state.unique()

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True])

In [39]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393

## usa_ele_sec_expenditure_percent_gov_states

In [40]:
df0 = pd.read_csv('./data/data_raw/usa_ele_sec_expenditure_percent_gov_states.csv')

** use** Not complete

In [41]:
df0.Date.unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [42]:
df0.head()

,region,indicator,Unit,Date,Value
0,Connecticut,Elementary and Secondary Education Expenditure...,%,1998,14.4
1,Connecticut,Elementary and Secondary Education Expenditure...,%,1999,15.2
2,Connecticut,Elementary and Secondary Education Expenditure...,%,2000,13.7
3,Connecticut,Elementary and Secondary Education Expenditure...,%,2001,13.6
4,Connecticut,Elementary and Secondary Education Expenditure...,%,2002,13.3

In [43]:
df0.Value = df0.Value / 100

In [44]:
df = df.join(
    df0.set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])


df = df.drop(['indicator', 'Unit'], axis = 1)

df.columns = df.columns.str.replace('Value', 'edu_expenditure_percent_gov_income')

## usa_18_year_old_in_education_national

In [45]:
df0 = pd.read_csv('./data/data_raw/usa_18_year_old_in_education_national.csv')

**Drop**

In [46]:
df0.Date.unique()

array([2001, 2002, 2003, 2004, 2005, 2012])

## usa_population_state.csv

In [47]:
df0 = pd.read_csv('./data/data_raw/usa_population_state.csv')

In [48]:
len(df0.region.unique())

51

In [49]:
df0.head()

    region                    series               Unit  Date     Value
0  Alabama  Resident Population, NSA  Thous. of Persons  1992  4139.269
1  Alabama  Resident Population, NSA  Thous. of Persons  1993  4193.114
2  Alabama  Resident Population, NSA  Thous. of Persons  1994  4232.965
3  Alabama  Resident Population, NSA  Thous. of Persons  1995  4262.731
4  Alabama  Resident Population, NSA  Thous. of Persons  1996  4290.403

In [50]:
df0 = df0.drop(['series', 'Unit'], axis = 1)
df0.Value = df0.Value * 1000

In [51]:
df0.head()

    region  Date      Value
0  Alabama  1992  4139269.0
1  Alabama  1993  4193114.0
2  Alabama  1994  4232965.0
3  Alabama  1995  4262731.0
4  Alabama  1996  4290403.0

Take care of different state names:  
District of Columbia, DC ---> District of Columbia  
New York (States) --- > New York

In [52]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia, DC',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York (States)', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [53]:
df.state.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [54]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [55]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [56]:
df = df.join(df0.set_index(['region', 'Date']), how= 'left',on = ['state', 'year'])

In [57]:
df.columns = df.columns.str.replace('Value', 'population')

In [58]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0

In [59]:
df.isnull().sum()

state                                   0
year                                    0
enroll                                  0
total_revenue                           0
total_expenditure                       0
avg_attendence_elem_secd_schools       51
teachers_elem_secd_schools            306
high_school_completers_18_to_24       510
bachelor_completers_over_25           510
pupil_teacher_ratio                   255
pub_high_school_graduates             153
expenditure_per_pupil                  51
edu_expenditure_percent_gov_income     18
population                              0
dtype: int64

## usa_GDP_per_capita_state

+ Per capita read GDP by state
+ All industry total
+ chained 2009 dollars

In [60]:
df0 = pd.read_csv('./data/data_raw/usa_GDP_per_capita_state.csv')

In [61]:
df0.Date.unique()

array([1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007,
       2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [62]:
df0.head()

,classification,state,component,industry,Unit,Date,Value
0,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1997,54740
1,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1998,56416
2,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,1999,57724
3,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,2000,61355
4,NAICS,Connecticut,Per capita real GDP by state,All industry total,chained 2009 dollars,2001,61872

In [63]:
df = df.join(df0[['state', 'Date', 'Value']].set_index(['state', 'Date']), on = ['state', 'year'], how = 'left')

In [64]:
df.columns = df.columns.str.replace('Value', 'gdp_per_capita')
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223

## usa_tax_collection_state.csv

In [65]:
df0 = pd.read_csv('./data/data_raw/usa_tax_collection_state.csv')

In [66]:
df0.Date.unique()

array([1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002,
       2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015, 2016])

In [67]:
len(df0.region.unique())

46

In [68]:
df0.Unit.unique()

array(['Thous. of $'], dtype=object)

In [69]:
df0.Value = df0.Value *1000

In [70]:
df0.region.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'Florida', 'Georgia',
       'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa', 'Kansas',
       'Kentucky', 'Louisiana', 'Maine', 'Maryland', 'Massachusetts',
       'Michigan', 'Minnesota', 'Mississippi', 'Missouri', 'Montana',
       'Nebraska', 'New Hampshire', 'New Jersey', 'New Mexico',
       'New York (States)', 'North Carolina', 'North Dakota', 'Ohio',
       'Oklahoma', 'Oregon', 'Pennsylvania', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Tennessee', 'Utah', 'Vermont',
       'Virginia', 'West Virginia', 'Wisconsin'], dtype=object)

In [71]:
df.state.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [72]:
df0.head()

,region,series,Unit,Date,Value
0,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1992,164779000
1,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1993,189506000
2,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1994,218131000
3,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1995,236279000
4,Alabama,"State Government Tax Collections, Corporation ...",Thous. of $,1996,217616000

In [73]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [74]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['state', 'year'])
df.columns = df.columns.str.replace('Value', 'state_tax_collection')
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita,state_tax_collection
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284,2.430990e+08
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184,4.384380e+08
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185,5.231820e+08
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834,2.369690e+08
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223,6.638762e+09

## usa_per_capita_income_state.csv

In [75]:
df0 = pd.read_csv('./data/data_raw/usa_per_capita_income_state.csv')

In [76]:
df0.head()

    region                           series Unit  Date  Value
0  Alabama  Per Capita Personal Income, NSA    $  1992  17537
1  Alabama  Per Capita Personal Income, NSA    $  1993  18082
2  Alabama  Per Capita Personal Income, NSA    $  1994  18938
3  Alabama  Per Capita Personal Income, NSA    $  1995  19866
4  Alabama  Per Capita Personal Income, NSA    $  1996  20569

In [77]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [78]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['state', 'year'])
df.columns  = df.columns.str.replace('Value', 'income_per_capita')
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita,state_tax_collection,income_per_capita
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284,2.430990e+08,24258
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184,4.384380e+08,31651
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185,5.231820e+08,26232
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834,2.369690e+08,22784
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223,6.638762e+09,33095

## usa_num_known_property_crimes_state

In [79]:
df0 = pd.read_csv('./data/data_raw/usa_num_known_property_crimes_state.csv')

In [80]:
df0.Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016])

take care of name :  
'District Of Columbia' -- > 'District of Columbia'

In [81]:
df0.location.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District Of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [82]:
df.state.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [83]:
df0.location = df0.location.str.replace('District Of Columbia', 'District of Columbia')

In [84]:
df0.head()

  location                                  indicator     Unit  Date   Value
0  Alabama  Number of Property Crimes Known to Police  numbers  1990  161838
1  Alabama  Number of Property Crimes Known to Police  numbers  1991  168864
2  Alabama  Number of Property Crimes Known to Police  numbers  1992  163966
3  Alabama  Number of Property Crimes Known to Police  numbers  1993  168182
4  Alabama  Number of Property Crimes Known to Police  numbers  1994  174589

In [85]:
df = df.join(df0[['location', 'Date', 'Value']].set_index(['location', 'Date']), how = 'left', on = ['state', 'year'])
df.columns = df.columns.str.replace('Value', 'known_property_crimes')
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita,state_tax_collection,income_per_capita,known_property_crimes
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284,2.430990e+08,24258,151127.0
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184,4.384380e+08,31651,21074.0
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185,5.231820e+08,26232,271269.0
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834,2.369690e+08,22784,97501.0
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223,6.638762e+09,33095,1054010.0

## usa_unemployment_rate_state

In [86]:
df0 = pd.read_csv('./data/data_raw/usa_unemployment_rate_state.csv')
df0.head()

    region                 series Unit    Date  Value
0  Alabama  Unemployment Rate, SA    %  1990M1    6.7
1  Alabama  Unemployment Rate, SA    %  1990M2    6.7
2  Alabama  Unemployment Rate, SA    %  1990M3    6.7
3  Alabama  Unemployment Rate, SA    %  1990M4    6.7
4  Alabama  Unemployment Rate, SA    %  1990M5    6.6

In [87]:
df0.region.unique()  == df.state.unique()

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True])

In [88]:
df0.region = df0.region.str.replace('District of Columbia, DC', 'District of Columbia')
df0.region = df0.region.str.replace('New York \(States\)', 'New York')

In [89]:
df0.Date = pd.to_datetime(df0.Date, format='%YM%m', errors='coerce')

In [90]:
df0.head()

    region                 series Unit       Date  Value
0  Alabama  Unemployment Rate, SA    % 1990-01-01    6.7
1  Alabama  Unemployment Rate, SA    % 1990-02-01    6.7
2  Alabama  Unemployment Rate, SA    % 1990-03-01    6.7
3  Alabama  Unemployment Rate, SA    % 1990-04-01    6.7
4  Alabama  Unemployment Rate, SA    % 1990-05-01    6.6

In [91]:
df0  = df0.set_index('Date').groupby('region').Value.resample('Y').mean().to_frame().reset_index()
df0.head()

    region       Date     Value
0  Alabama 1990-12-31  6.791667
1  Alabama 1991-12-31  7.350000
2  Alabama 1992-12-31  7.566667
3  Alabama 1993-12-31  7.366667
4  Alabama 1994-12-31  6.191667

In [92]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1428 entries, 0 to 1427
Data columns (total 3 columns):
region    1428 non-null object
Date      1428 non-null datetime64[ns]
Value     1428 non-null float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 33.5+ KB

In [93]:
df0.Date = df0.Date.astype(str).apply(lambda x: x[:4])

In [94]:
df0.Value = df0.Value * 0.01

In [95]:
df0.Date = df0.Date.astype(int)

In [96]:
df0.head()

    region  Date     Value
0  Alabama  1990  0.067917
1  Alabama  1991  0.073500
2  Alabama  1992  0.075667
3  Alabama  1993  0.073667
4  Alabama  1994  0.061917

In [97]:
df = df.join(df0[['region', 'Date', 'Value']].set_index(['region', 'Date']), how = 'left', on = ['state', 'year'])
df.columns = df.columns.str.replace('Value', 'unemployment_rate')
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita,state_tax_collection,income_per_capita,known_property_crimes,unemployment_rate
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284,2.430990e+08,24258,151127.0,0.045750
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184,4.384380e+08,31651,21074.0,0.063583
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185,5.231820e+08,26232,271269.0,0.039750
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834,2.369690e+08,22784,97501.0,0.042750
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223,6.638762e+09,33095,1054010.0,0.049583

In [98]:
df.isnull().sum()

state                                   0
year                                    0
enroll                                  0
total_revenue                           0
total_expenditure                       0
avg_attendence_elem_secd_schools       51
teachers_elem_secd_schools            306
high_school_completers_18_to_24       510
bachelor_completers_over_25           510
pupil_teacher_ratio                   255
pub_high_school_graduates             153
expenditure_per_pupil                  51
edu_expenditure_percent_gov_income     18
population                              0
gdp_per_capita                          0
state_tax_collection                   80
income_per_capita                       0
known_property_crimes                   5
unemployment_rate                       0
dtype: int64

In [99]:
df0.Date.unique()

array([1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000,
       2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017])

In [100]:
df.isnull().sum()

state                                   0
year                                    0
enroll                                  0
total_revenue                           0
total_expenditure                       0
avg_attendence_elem_secd_schools       51
teachers_elem_secd_schools            306
high_school_completers_18_to_24       510
bachelor_completers_over_25           510
pupil_teacher_ratio                   255
pub_high_school_graduates             153
expenditure_per_pupil                  51
edu_expenditure_percent_gov_income     18
population                              0
gdp_per_capita                          0
state_tax_collection                   80
income_per_capita                       0
known_property_crimes                   5
unemployment_rate                       0
dtype: int64

In [101]:
df.columns

Index(['state', 'year', 'enroll', 'total_revenue', 'total_expenditure',
       'avg_attendence_elem_secd_schools', 'teachers_elem_secd_schools',
       'high_school_completers_18_to_24', 'bachelor_completers_over_25',
       'pupil_teacher_ratio', 'pub_high_school_graduates',
       'expenditure_per_pupil', 'edu_expenditure_percent_gov_income',
       'population', 'gdp_per_capita', 'state_tax_collection',
       'income_per_capita', 'known_property_crimes', 'unemployment_rate'],
      dtype='object')

In [102]:
df.head()

,state,year,enroll,total_revenue,total_expenditure,avg_attendence_elem_secd_schools,teachers_elem_secd_schools,high_school_completers_18_to_24,bachelor_completers_over_25,pupil_teacher_ratio,pub_high_school_graduates,expenditure_per_pupil,edu_expenditure_percent_gov_income,population,gdp_per_capita,state_tax_collection,income_per_capita,known_property_crimes,unemployment_rate
0,Alabama,2000,730184.0,4885917,5003267,725212.0,48194.4,0.722477,0.190,15.354315,37819.0,5758.428628,0.250,4452173.0,33284,2.430990e+08,24258,151127.0,0.045750
1,Alaska,2000,132822.0,1313510,1386904,122412.0,7880.4,0.769277,0.247,16.922491,6615.0,9668.161193,NaN,627963.0,57184,4.384380e+08,31651,21074.0,0.063583
2,Arizona,2000,814807.0,5479168,5397194,782851.0,44438.4,0.692453,0.235,19.750846,38304.0,5478.359673,0.190,5160586.0,39185,5.231820e+08,26232,271269.0,0.039750
3,Arkansas,2000,450751.0,2844855,2683400,422958.0,31947.4,0.754282,0.167,14.084370,27335.0,5627.818516,0.195,2678588.0,31834,2.369690e+08,22784,97501.0,0.042750
4,California,2000,5941946.0,46628207,45829753,5957216.0,298021.4,0.707395,0.266,20.605279,309866.0,6400.553393,0.260,33987977.0,48223,6.638762e+09,33095,1054010.0,0.049583

In [103]:
#df.to_csv('./data/data_cleaned/combined_data_state_level_from_2000.csv', index = False)

# National Level Data

+ us-dollar-index-historical-chart.csv
+ usa_youth_access_to_edu_national.csv
+ usa_18_year_old_in_education_national.csv